7767517
11 13
Input            input                            0 1 input 0=0 1=0 2=0
Split            splitncnn_0                      1 3 input input_splitncnn_0 input_splitncnn_1 input_splitncnn_2
MemoryData       prelu_0/prelu/read               0 1 prelu_0/prelu/read 0=1 1=0 2=0
Reduction        prelu_0/Maximum                  1 1 input_splitncnn_2 prelu_0/Maximum 0=4 1=3 2=1.000000
Reduction        prelu_0/Minimum                  1 1 input_splitncnn_1 prelu_0/Minimum 0=5 1=3 2=1.000000
BinaryOp         prelu_0/mul                      2 1 prelu_0/prelu/read prelu_0/Minimum prelu_0/mul 0=2
BinaryOp         prelu_0/add                      2 1 prelu_0/Maximum prelu_0/mul prelu_0/add 0=0
ConvolutionDepthWise cons_0/separable_conv2d/depthwise 1 1 prelu_0/add cons_0/separable_conv2d/depthwise 0=3 1=9 11=5 2=1 12=1 3=4 13=4 4=-233 5=0 6=135 7=3
Convolution      cons_0/separable_conv2d          1 1 cons_0/separable_conv2d/depthwise cons_0/separable_conv2d 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 5=0 6=24
Deconvolution    dcons_0/conv2d_transpose         1 1 cons_0/separable_conv2d dcons_0/conv2d_transpose 0=3 1=9 11=5 2=1 12=1 3=4 13=4 4=-233 5=0 6=1080
BinaryOp         output                           2 1 dcons_0/conv2d_transpose input_splitncnn_0 output 0=0
